{
  "vacancies": [
    {
      "title": "Sales/Presales Manager (Belarus)",
      "inner": {
        "description": "We are looking for a strong Sales/Presales Manager to join our team in Belarus (Minsk).",
        "details": [
          {
            "title": "Responsibilities",
            "list": [
              "Work on incoming business opportunities and software development requests from potential clients, including identification and development of their needs",
              "Arrange and take part in meetings with clients to define business needs and goals, as well as collect project requirements",
              "Conduct initial requirements analysis, aligning Qaprosoft capabilities with clients’ business needs",
              "Assemble a team efficient for a specific request processing; closely work with the team to develop potential solutions for clients’ business challenges",
              "Present solutions to clients, positioning Qaprosoft experience and services as a competitive advantage and a key differentiator",
              "Prepare business proposals; create documents for clients, featuring Qaprosoft experience, services, and values",
              "Deal with business uncertainty in order to develop the dialogue with a client till the deal closure and further transfer of the project to the development team"
            ]
          },
          {
            "title": "Requirements",
            "list": [
              "2+ years of overall IT experience",
              "Understanding of software development lifecycle",
              "Strong written and spoken English (Advanced)",
              "Experience in creating well-structured and easy-to-read documents and presentations",
              "Proficient skills in conducting presentations to different types of audiences (C-Level, engineering team, etc.)",
              "Ability to make decisions under uncertainty"
            ]
          },
          {
            "title": "Experience in one or several of these areas will be a major plus",
            "list": [
              "Business negotiating",
              "Business analysis of commercial projects",
              "Creating project delivery and team onboarding plans",
              "Risk management: detecting potential business/technical risks in project delivery and implementation",
              "Technical background"

            ]
          },
          {
            "title": "Benefits",
            "list": [
              "Competitive salary",
              "Comfortable work environment",
              "Comfortably equipped office in the City center near “Lenin Square” subway station, and a large parking lot",
              "Modern office equipped with lounge room",
              "Fruits, cookies, and drinks at the office",
              "Free English classes at the office",
              "Paid professional conferences and meetups",
              "Computer Mac — for every employee!",
              "Other perks and bonuses",
              "Flexible start of the working day from 9 AM to 11 AM"
            ]
          }
        ]
      }
    },
    {
      "title": "Middle PHP Developer (Belarus)",
      "inner": {
        "description": "Now we are starting a new and long-term Healthcare project. We are looking for a Middle PHP Developer to join our team in Belarus (Minsk) and to complete all the emerging/new tasks.",
        "details": [
          {
            "title": "Requirements",
            "list": [
              "2+ years of practical experience",
              "Excellent knowledge of PHP, JS, WordPress, RESTFul APIs",
              "Knowledge of  Laravel, WooCommerce опыт, Angular would be a HUGE plus",
              "English - A2 and upper"
            ]
          },
          {
            "title": "Benefits",
            "list": [
              "Interesting and stable project with practical benefits",
              "A wide field to express your initiative and a friendly atmosphere in the team",
              "Career opportunities",
              "Free English classes at the office",
              "Paid conference attendances and the purchase of a professional literature",
              "We play volleyball together every Friday",
              "We have our own Elevator Pitch where you can present your project or receive investment for its development and get valuable prizes",
              "Comfortably equipped office in the City center near “Lenin Square” subway station, and a large parking lot",
              "We often have pizza and board games parties and we love to watch sports championships together",
              "Modern office equipped with lounge room",
              "Fruits, cookies, and drinks at the office",
              "Flexible start of the working day from 9 AM to 11 AM",
              "You can contribute to developing our own open-source products and see the practical results of your work as more and more people use them"
            ]
          }
        ]
      }
    },
    {
      "title": "Senior/Middle Android Developer (Belarus)",
      "inner": {
        "description": "Currently, our development team is working on a popular musical app for karaoke (with over 50 million users worldwide) and our project is growing rapidly. We are looking for an Android Developer to join our team in Belarus (Minsk) and to work for this project.",
        "details": [
          {
            "title": "Requirements",
            "list": [
              "Excellent knowledge of Java, Android, multithreading, and UI",
              "Believe in TDD philosophy",
              "Be passionate about your work",
              "4+ years of experience",
              "English - B1 and upper"
            ]
          },
          {
            "title": "Benefits",
            "list": [
              "An enthusiastic senior-level team and a stable project",
              "Paid conference attendances and the purchase of a professional literature",
              "We often have pizza and board games parties and we love to watch sports championships together",
              "Every Friday the whole team plays volleyball",
              "Free English classes at the office",
              "Modern office equipped with lounge room",
              "Fruits, cookies, and drinks at the office",
              "Our own Elevator Pitch - an internal contest of our employees’ projects with a chance to win valuable prizes",
              "You can contribute to developing our own open-source products and see the practical results of your work as more and more people use them"
            ]
          }
        ]
      }
    },
    {
      "title": "Senior QA Engineer (Ukraine)",
      "inner": {
        "description": "With regards to a new office opening, Qaprosoft (Ukraine) is looking for a strong Senior QA Engineer to join the team in Chernivtsi, Ukraine.",
        "details": [
          {
            "title": "Responsibilities",
            "list": [
              "Design functional, integration and regression test plans",
              "Build and execute manual and automated tests and perform highly complex analysis for multiple products",
              "Set cross-functional product testing standards",
              "Analyze, evaluate and plan methods of approach and organize means to achieve solutions to complex problems",
              "Create reports",
              "Work both independently and in the close collaboration with other team members and across the business (different apps with shared user base)"
            ]
          },
          {
            "title": "Requirements",
            "list": [
              "2-3 years experience in software testing (WEB and Mobile)",
              "Knowledge of development cycle for mobile/web applications",
              "Knowledge of specifics of iOS and Android",
              "Advanced level of Jira/Confluence knowledge",
              "Experience in using TestRail or another test cases management systems",
              "Basics of xCode/Android studio",
              "Monitoring tools: xCode logs, adb logs, browsers dev tools",
              "Knowledge of HTML proxy tools would be an advantage",
              "Work schedule: <strong>5 pm - 1 am Kiev time/ 7 pm - 3 am</strong> Kiev time on Winter; <strong>4 pm - 11 pm</strong> Kiev time on Summer"
            ]
          },
          {
            "title": "Benefits",
            "list": [
              "Competitive salary",
              "Comfortable work environment",
              "Brand new modern office located in a peaceful green zone",
              "Family mode office atmosphere",
              "Remote work opportunity",
              "Fruits, cookies, and drinks at the office",
              "Free English classes at the office",
              "Free accounting services",
              "Long-term projects and stable projects",
              "4-weeks paid vacation",
              "Paid professional conferences and meetups",
              "Corporate discounts and events",
              "Computer Mac — for every employee!",
              "Other perks and bonuses"
            ]
          }
        ]
      }
    },
    {
      "title": "Middle Manual QA Engineer (Belarus)",
      "inner": {
        "description": "Now we are inviting a Middle Manual QA Engineer to join our team in Belarus (Minsk) and work for a large fitness project. This app emerged in 2005 and has been on the increase/growing ever since. The app tracks the health status, physical indicators, and sports progress. The app lets you set personal goals and achieve excellent results (the app has over 200 million users who tested its effectiveness).<br/>This project’s schedule would be perfect for the night owls.",
        "details": [
          {
            "title": "Requirements",
            "list": [
              "you have an agile mind, love to learn everything new and improve your own professional skills",
              "2+ years of software testing (WEB and Mobile)",
              "Experience in working with foreign customers (English - Intermediate and upper). There’s a good communication process established between the client and developers on this project, the team itself consists of more than 20 people"
            ]
          },
          {
            "title": "Benefits",
            "list": [
              "You are provided with all the devices necessary for work (Apple)",
              "Remote work from home",
              "A large team of experienced colleagues",
              "No early alarm bell and traffic jam",
              "Constant practice in speaking English with the customer and internal English courses for the employees",
              "Paid conference attendances and the purchase of professional literature",
              "Our own Elevator Pitch for the employees"
            ]
          }
        ]
      }
    },
    {
      "title": "Manual QA Lead/ Team Lead (Ukraine)",
      "inner": {
        "description": "With regards to a new office opening, Qaprosoft (Ukraine) is looking for a talented and ambitious Manual QA Lead/ Team Lead to join the team in Chernivtsi, Ukraine.",
        "details": [
          {
            "title": "Requirements",
            "list": [
              "Extensive product quality assurance and testing experience within different domains - 3+ years of experience",
              "Great soft and communication skills",
              "Proactivity in managing priorities for the team and the project",
              "Mentorship experience and ability to review and audit efforts by fellow members",
              "Solid understanding of Methodologies and QA practices"
            ]
          },
          {
            "title": "Preferred Skills",
            "list": [
              "Team management skills is a big plus",
              "Ability to lead the team to make it even stronger",
              "Good judgment and ability to prioritize the business and project needs",
              "Experience in using TestRail or another test case management system",
              "Experience with running automated tests on a CI pipeline (Jenkins preferable)",
              "Experience with mobile testing and automation",
              "Knowledge of development cycle for mobile/web applications",
              "Knowledge of specifics of iOS and Android",
              "Advanced level of Jira/Confluence knowledge",
              "Knowledge of HTML proxy tools would be an advantage"
            ]
          },
          {
            "title": "Responsibilities",
            "list": [
              "Build QA processes on the project from scratch",
              "Managing a test team (up to 6 members) and planning workload",
              "Resource management",
              "Design test strategies",
              "Create test reports for software releases",
              "Participate in the Agile planning and design process for new features and initiatives",
              "Design, plan and execute tests which validate software specs"
            ]
          },
          {
            "title": "Benefits",
            "list": [
              "Competitive salary",
              "Comfortable work environment",
              "Brand new modern office located in a peaceful green zone",
              "Family mode office atmosphere",
              "Fruits, cookies, and drinks at the office",
              "Free English classes at the office",
              "Free accounting services",
              "Long-term projects and stable projects",
              "4-weeks paid vacation",
              "Paid professional conferences and meetups",
              "Corporate discounts and events",
              "Computer Mac — for every employee!",
              "Other perks and bonuses"
            ]
          }
        ]
      }
    },
    {
      "title": "Senior IOS Developer (Belarus)",
      "inner": {
        "description": "Our project is a native application written in Objective-C using C++ and a tendency of gradually transitioning to Switch, which allows users from different continents to sing karaoke together. Now we are looking for a Senior iOS Developer to join our team in Belarus (Minsk).",
        "details": [
          {
            "title": "Requirements",
            "list": [
              "4+ years of experience in developing of the native mobile iOS apps",
              "Excellent knowledge of Objective-C and Cocoa Touch",
              "Design patterns, IoC, DI, SOLID, KISS’",
              "Expert-level understanding of RESTful APIs and client-server communication",
              "Believe in TDD philosophy",
              "English - B1"
            ]
          },
          {
            "title": "Benefits",
            "list": [
              "An enthusiastic team and a stable project",
              "We play volleyball every Friday",
              "Free English classes at the office",
              "Comfortably equipped office in the City center near the subway station, with a large parking lot",
              "Paid conference attendances and the purchase of professional literature",
              "We have our own Elevator Pitch where you can present your project or receive investment for its development and get valuable prizes",
              "We often have pizza and board games parties and we love to watch sports championships together",
              "Modern office equipped with lounge room",
              "Fruits, cookies, and drinks at the office",
              "You can contribute to developing our own open-source products and see the practical results of your work as more and more people use them"
            ]
          }
        ]
      }
    }
  ]
}




